app/controllers/forums_controller.rb

  def search
	s=Search.new
	if (! ((params[:search].blank?) || ((params[:search_message].nil?)&&(params[:search_topic].nil?))) )
---
SELECT * FROM "messages" WHERE (create_time>'week' and name LIKE '%d%' OR create_time>'week' and content LIKE '%d%')
SELECT * FROM "topics" WHERE ("topics".forum_id = 5 AND (name LIKE '%dd%' and create_time>'week'))

  def show
    begin
		@forum = Forum.find(params[:id])
---
SELECT * FROM "forums" WHERE ("forums"."id" = 1)

  def edit
		@forum = Forum.find(params[:id])
---
SELECT * FROM "forums" WHERE ("forums"."id" = 1)

  def create
    @forum = Forum.new(params[:forum])
      if @forum.save
---
INSERT INTO "forums" ("name", "updated_at", "creator_id", "create_time", "created_at") VALUES('MyForum', '2010-07-02 07:37:16', 1, '2010-07-02 07:36:56', '2010-07-02 07:37:16')

  def update
    @forum = Forum.find(params[:id])

      if @forum.update_attributes(params[:forum])
---
SELECT * FROM "forums" WHERE ("forums"."id" = 1)
UPDATE "forums" SET "name" = 'SanekForum', "updated_at" = '2010-07-04 12:40:50' WHERE "id" = 1

  def destroy
		@forum = Forum.find(params[:id])
		@forum.destroy
---
SELECT * FROM "forums" WHERE ("forums"."id" = 2)
DELETE FROM "forums" WHERE "id" = 2