app/controllers/messages_controller.rb

SELECT * FROM "messages" WHERE ("messages"."id" = 0)
---
  def show
    @message = Message.find(params[:id])