app/controllers/messages_controller.rb

  def edit
		@message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 22)

  def create
    @message = Message.new(:content=> params[:message][:content],
	:name=> params[:message][:name],
	:topic_id=>params[:message][:topic_id],
	:create_time=>params[:message][:create_time],
	:user_id=>params[:message][:user_id])
	Topic.find(params[:message][:topic_id]).update_attribute(:last_edit,params[:message][:create_time])
    respond_to do |format|
      if @message.save
---
SELECT * FROM "topics" WHERE ("topics"."id" = '--- :topic_id
UPDATE "topics" SET "last_edit" = '2010-07-09 11:49:45', "updated_at" = '2010-07-09 11:51:44' WHERE "id" = 3
INSERT INTO "messages" ("topic_id", "name", "updated_at", "create_time", "content", "user_id", "created_at") VALUES(7, 'ТОлько зарегестрированным пользователям', '2010-07-12 13:44:51', '2010-07-12 13:43:02', 'Добавлять топики и месаги могут только зарегиные пользователи. Я даже кнопочки для гостей убрал.