app/controllers/topics_controller.rb

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
---
  def show
    @topic = Topic.find(params[:id])

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
---
  def edit
    @topic = Topic.find(params[:id])

INSERT INTO "topics" ("name", "last_edit", "updated_at", "creator_id", "create_time", "forum_id", "created_at") VALUES('O pashtete', '2010-07-02 07:37:20', '2010-07-02 07:37:39', NULL, '2010-07-02 07:37:20', 1, '2010-07-02 07:37:39')
---
  def create
    @topic = Topic.new(params[:topic])
	if @topic.save

SELECT * FROM "topics" WHERE ("topics"."id" = 1)
UPDATE "topics" SET "creator_id" = 1, "create_time" = '2010-07-04 12:49:00', "last_edit" = '2010-07-04 12:54:00', "updated_at" = '2010-07-04 12:54:17' WHERE "id" = 1
---
  def update
    @topic = Topic.find(params[:id])

    respond_to do |format|
      if @topic.update_attributes(params[:topic])